package org.example.task;

/**
 *1. Найти самое короткое и самое длинное число. Вывести найденные числа
 * и их длину.
 */
public class Task1 extends Task{
    @Override
    public void task() {
        System.out.println("\n1. Найти самое короткое и самое длинное число. Вывести найденные числа\n" +
                "и их длину.");
    }
}
